import {atom} from 'recoil';
import {IArticle, INew} from "../../types";


export const yourself = atom<IArticle>({
    key: 'yourself',
    default: {
        id: 2,
        title: "Узнавайте сами",
        images: [''],
        page: <h1>{'Разводная страница с разделами.'}</h1>,
        link: '',
        description: 'Разводная страница с разделами.',
        menu: [
            {
                id: 0,
                title: "Лекторий \"Бахрушинская академия\"",
                images: [''],
                page: <h1>{'Страница со всеми лекционными программами и возможностью купить абонемент (как у Третьяковки)'}</h1>,
                link: '/academy/',
                description: 'Страница со всеми лекционными программами и возможностью купить абонемент (как у Третьяковки)',
            },
            {
                id: 1,
                title: "Издания",
                images: [''],
                page: <h1>{'Описательная страница об издательской деятельности, форма обратной связи и контакты издательского отдела, внизу список изданий Музея с фотографиями. - при клике на каждое издание переход на описательную страницу издания с информацией, переходом для покупки в интернет-магазин или возможностью скачать для чтения.'}</h1>,
                link: '/edition/',
                description: 'Описательная страница об издательской деятельности, форма обратной связи и контакты издательского отдела, внизу список изданий Музея с фотографиями. - при клике на каждое издание переход на описательную страницу издания с информацией, переходом для покупки в интернет-магазин или возможностью скачать для чтения.',
            },
            {
                id: 2,
                title: "Коллекции онлайн",
                images: [''],
                page: <h1>{'Сайт сателлит - Колекции онлайн'}</h1>,
                link: '/collection/',
                description: 'Сайт сателлит - Колекции онлайн',
            },
            {
                id: 3,
                title: "Научная библиотека",
                images: [''],
                page: <h1>{'Описательная страница о научной библиотеке, форма обратной связи и контакты библиотеки- поставить пометку \\"ПРО\\"'}</h1>,
                link: '/lib/',
                description: 'Описательная страница о научной библиотеке, форма обратной связи и контакты библиотеки- поставить пометку \\"ПРО\\"',
            },
            {
                id: 4,
                title: "Бахрушинские чтения",
                images: [''],
                page: <h1>{"- описательная страница с общей информацией о конференции с фото/видео материалами, контакты организаторов, форма обратной связи с кнопкой \"принять участие\", программа будущей конференции, возможность перейти к архиву конференций, кнопкой перейти к онлайн трансляции (если такая будет)" +
                    "- отдельная страница по каждой конференции из архива с описанием, программой, фото/видео отчетом." +
                    "- поставить пометку \"ПРО\""}</h1>,
                link: '/readings/',
                description: "- описательная страница  с общей информацией о конференции с фото/видео материалами, контакты организаторов, форма обратной связи с кнопкой \"принять участие\", программа будущей конференции, возможность перейти к архиву конференций, кнопкой перейти к онлайн трансляции (если такая будет)" +
                    "- отдельная страница по каждой конференции из архива с описанием, программой, фото/видео отчетом." +
                    "- поставить пометку \"ПРО\"",
            },
            {
                id: 5,
                title: "Конференции и форумы",
                images: [''],
                page: <h1>{"Разводная страница с общей информацией о разделе и разделением вглубь на \"конференции и форумы\" с возможностью перехода на каждый подраздел" +
                    "- подраздел \"конференции\" страница с перечнем всех конференций и возможностью перехода на страницу каждой отдельной конференции" +
                    "- подраздел \"форумы\" страница с перечнем всех форумов и возможностью перехода на страницу каждой отдельного форума" +
                    "- поставить пометку \"ПРО\""}</h1>,
                link: '/forums/',
                description: "Разводная страница с общей информацией о разделе и разделением вглубь на \"конференции и форумы\" с возможностью перехода на каждый подраздел" +
                    "- подраздел \"конференции\" страница с перечнем всех конференций и возможностью перехода на страницу каждой отдельной конференции" +
                    "- подраздел \"форумы\" страница с перечнем всех форумов и возможностью перехода на страницу каждой отдельного форума" +
                    "- поставить пометку \"ПРО\"",
            },

        ]
    }
});